/* ---------------- Hide‑and‑Seek 遊戲配置 ---------------- */

export const PLACES = [
  {
    id:  'p1',
    name:'宮原眼科',
    lat: 24.136797, lng: 120.684351,
    code:'13579',
    hint:`這棟巴洛克紅磚樓，曾治癒雙眼。
如今治癒人心的，是 17 種冰淇淋口味。`
  },
  {
    id:  'p2',
    name:'第二市場',
    lat: 24.138927, lng: 120.684996,
    code:'24680',
    hint:`黎明六點開門，蒸汽伴豬血湯冒煙。
請數數有幾根圓形綠柱，乘以 10，就是密碼。`
  },
  {
    id:  'p3',
    name:'臺中州廳',
    lat: 24.140124, lng: 120.683437,
    code:'11223',
    hint:`昔日州長辦公室，聽說半夜還能聽到老打字機聲。
門口獅子各幾隻？左乘右，就是答案。`
  },
  {
    id:  'p4',
    name:'綠川水岸',
    lat: 24.137401, lng: 120.686092,
    code:'33445',
    hint:`河水染上翡翠色前，
它曾被稱作「臭水溝」。
猜猜花瓣造型座椅有幾張？`
  },
  {
    id:  'p5',
    name:'第四信用合作社',
    lat: 24.137931, lng: 120.683143,
    code:'55667',
    hint:`從金庫變霜淇淋實驗室，
抬頭找「Savings Bank」浮雕字。
共有幾個英文字母？重複也算。`
  },
  {
    id:  'p6',
    name:'台中舊火車站',
    lat: 24.136820, lng: 120.685745,
    code:'77889',
    hint:`古典洋蔥穹頂下，
一秒連結 1908 與 2025。
請將月台編號總數 ×2。`
  },
  {
    id:  'p7',
    name:'萬春宮',
    lat: 24.139322, lng: 120.680154,
    code:'99001',
    hint:`香火三百年，拜媽祖也拜月老。
門神握有幾把兵器？`
  },
  {
    id:  'p8',
    name:'柳川藍帶水岸',
    lat: 24.135548, lng: 120.682215,
    code:'22334',
    hint:`夜晚燈光倒映如藍絲帶。
沿岸總共有幾隻「柳川鴨」裝置？`
  },
  {
    id:  'p9',
    name:'臺中文學館',
    lat: 24.140986, lng: 120.684868,
    code:'44556',
    hint:`日式警察宿舍群變身紙屋書海。
跟著「文字雨」裝置數階梯，再加 100。`
  },
  {
    id:  'p10',
    name:'日曜天地 OUTLET',
    lat: 24.142313, lng: 120.684942,
    code:'66778',
    hint:`舊倉庫蛻變時尚商場。
請數戶外大鐘旁的圓形燈箱數量。`
  }
];

/* 抵達判定距離（公尺） */
export const RADIUS = 60000;